balazsgrill/modembed/res/Devices/dsPIC33/PIC24EP128GP204.PIC
      <edc:DCRDef edc:access="--------nnnnnnnn" edc:cname="FWDT" edc:default="0xFFFF" edc:desc="" edc:impl="0xff" edc:name="FWDT" edc:nzwidth="0x10" edc:unimplval="0" edc:unused="0x0" edc:useinchecksum="0xffff">
        <edc:AliasList/>
        <edc:DCRModeList>
          <edc:DCRMode edc:id="DS.0">
            <edc:DCRFieldDef edc:cname="WDTPOST" edc:desc="Watchdog Timer Postscaler bits" edc:mask="0xf" edc:name="WDTPOST" edc:nzwidth="0x4">
              <edc:DCRFieldSemantic edc:cname="PS32768" edc:desc="1:32,768" edc:when="(field &amp; 0xf) == 0xf"/>
              <edc:DCRFieldSemantic edc:cname="PS16384" edc:desc="1:16,384" edc:when="(field &amp; 0xf) == 0xe"/>
              <edc:DCRFieldSemantic edc:cname="PS8192" edc:desc="1:8,192" edc:when="(field &amp; 0xf) == 0xd"/>
              <edc:DCRFieldSemantic edc:cname="PS4096" edc:desc="1:4,096" edc:when="(field &amp; 0xf) == 0xc"/>
              <edc:DCRFieldSemantic edc:cname="PS2048" edc:desc="1:2,048" edc:when="(field &amp; 0xf) == 0xb"/>
              <edc:DCRFieldSemantic edc:cname="PS1024" edc:desc="1:1,024" edc:when="(field &amp; 0xf) == 0xa"/>
              <edc:DCRFieldSemantic edc:cname="PS512" edc:desc="1:512" edc:when="(field &amp; 0xf) == 0x9"/>
              <edc:DCRFieldSemantic edc:cname="PS256" edc:desc="1:256" edc:when="(field &amp; 0xf) == 0x8"/>
              <edc:DCRFieldSemantic edc:cname="PS128" edc:desc="1:128" edc:when="(field &amp; 0xf) == 0x7"/>
              <edc:DCRFieldSemantic edc:cname="PS64" edc:desc="1:64" edc:when="(field &amp; 0xf) == 0x6"/>
              <edc:DCRFieldSemantic edc:cname="PS32" edc:desc="1:32" edc:when="(field &amp; 0xf) == 0x5"/>
              <edc:DCRFieldSemantic edc:cname="PS16" edc:desc="1:16" edc:when="(field &amp; 0xf) == 0x4"/>
              <edc:DCRFieldSemantic edc:cname="PS8" edc:desc="1:8" edc:when="(field &amp; 0xf) == 0x3"/>
              <edc:DCRFieldSemantic edc:cname="PS4" edc:desc="1:4" edc:when="(field &amp; 0xf) == 0x2"/>
              <edc:DCRFieldSemantic edc:cname="PS2" edc:desc="1:2" edc:when="(field &amp; 0xf) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="PS1" edc:desc="1:1" edc:when="(field &amp; 0xf) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="WDTPRE" edc:desc="Watchdog Timer Prescaler bit" edc:mask="0x1" edc:name="WDTPRE" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="PR128" edc:desc="1:128" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="PR32" edc:desc="1:32" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="PLLKEN" edc:desc="PLL Lock Enable bit" edc:mask="0x1" edc:name="PLLKEN" edc:nzwidth="1">
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="Clock switch to PLL source will wait until the PLL lock signal is valid." edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="Clock switch will not wait for the PLL lock signal." edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="WINDIS" edc:desc="Watchdog Timer Window Enable bit" edc:mask="0x1" edc:name="WINDIS" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="Watchdog Timer in Non-Window mode" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="Watchdog Timer in Window mode" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="FWDTEN" edc:desc="Watchdog Timer Enable bit" edc:mask="0x1" edc:name="FWDTEN" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="Watchdog timer always enabled" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="Watchdog timer enabled/disabled by user software" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
          </edc:DCRMode>
        </edc:DCRModeList>
      </edc:DCRDef>
      <edc:DCRDef edc:access="--------nnn--nnn" edc:cname="FOSC" edc:default="0xFFFF" edc:desc="" edc:impl="0xe7" edc:name="FOSC" edc:nzwidth="0x10" edc:unimplval="0" edc:unused="0x0" edc:useinchecksum="0xffff">
        <edc:AliasList/>
        <edc:DCRModeList>
          <edc:DCRMode edc:id="DS.0">
            <edc:DCRFieldDef edc:cname="POSCMD" edc:desc="Primary Oscillator Mode Select bits" edc:mask="0x3" edc:name="POSCMD" edc:nzwidth="0x2">
              <edc:DCRFieldSemantic edc:cname="NONE" edc:desc="Primary Oscillator disabled" edc:when="(field &amp; 0x3) == 0x3"/>
              <edc:DCRFieldSemantic edc:cname="HS" edc:desc="HS Crystal Oscillator Mode" edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:DCRFieldSemantic edc:cname="XT" edc:desc="XT Crystal Oscillator Mode" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="EC" edc:desc="EC (External Clock) Mode" edc:when="(field &amp; 0x3) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="OSCIOFNC" edc:desc="OSC2 Pin Function bit" edc:mask="0x1" edc:name="OSCIOFNC" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="OSC2 is clock output" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="OSC2 is general purpose digital I/O pin" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:AdjustPoint edc:offset="2"/>
            <edc:DCRFieldDef edc:cname="IOL1WAY" edc:desc="Peripheral pin select configuration" edc:mask="0x1" edc:name="IOL1WAY" edc:nzwidth="1">
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="Allow only one reconfiguration" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="Allow multiple reconfigurations" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="FCKSM" edc:desc="Clock Switching Mode bits" edc:mask="0x3" edc:name="FCKSM" edc:nzwidth="0x2">
              <edc:DCRFieldSemantic edc:cname="CSDCMD" edc:desc="Both Clock switching and Fail-safe Clock Monitor are disabled" edc:when="(field &amp; 0x2) == 0x2"/>
              <edc:DCRFieldSemantic edc:cname="CSECMD" edc:desc="Clock switching is enabled,Fail-safe Clock Monitor is disabled" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="CSECME" edc:desc="Both Clock switching and Fail-safe Clock Monitor are enabled" edc:when="(field &amp; 0x3) == 0x0"/>
            </edc:DCRFieldDef>
          </edc:DCRMode>
        </edc:DCRModeList>
      </edc:DCRDef>
      <edc:DCRDef edc:access="--------n----nnn" edc:cname="FOSCSEL" edc:default="0xffff" edc:desc="" edc:impl="0x87" edc:name="FOSCSEL" edc:nzwidth="0x10" edc:unimplval="0" edc:unused="0x0" edc:useinchecksum="0xffff">
        <edc:AliasList/>
        <edc:DCRModeList>
          <edc:DCRMode edc:id="DS.0">
            <edc:DCRFieldDef edc:cname="FNOSC" edc:desc="Oscillator Source Selection" edc:mask="0x7" edc:name="FNOSC" edc:nzwidth="0x3">
              <edc:DCRFieldSemantic edc:cname="FRCDIVN" edc:desc="Internal Fast RC (FRC) Oscillator with postscaler" edc:when="(field &amp; 0x7) == 0x7"/>
              <edc:DCRFieldSemantic edc:cname="LPRC" edc:desc="Low-Power RC Oscillator (LPRC)" edc:when="(field &amp; 0x7) == 0x5"/>
              <edc:DCRFieldSemantic edc:cname="PRIPLL" edc:desc="Primary Oscillator with PLL module (XT + PLL, HS + PLL, EC + PLL)" edc:when="(field &amp; 0x7) == 0x3"/>
              <edc:DCRFieldSemantic edc:cname="PRI" edc:desc="Primary Oscillator (XT, HS, EC)" edc:when="(field &amp; 0x7) == 0x2"/>
              <edc:DCRFieldSemantic edc:cname="FRCPLL" edc:desc="Fast RC Oscillator with divide-by-N with PLL module (FRCPLL)" edc:when="(field &amp; 0x7) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="FRC" edc:desc="Internal Fast RC (FRC)" edc:when="(field &amp; 0x7) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:DCRFieldDef edc:cname="IESO" edc:desc="Two-speed Oscillator Start-up Enable bit" edc:mask="0x1" edc:name="IESO" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="Start up device with FRC, then switch to user-selected oscillator source" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="Start up with user-selected oscillator source" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
          </edc:DCRMode>
        </edc:DCRModeList>
      </edc:DCRDef>
      <edc:DCRDef edc:access="--------------nn" edc:cname="FGS" edc:default="0xFFFF" edc:desc="" edc:impl="0x3" edc:name="FGS" edc:nzwidth="16" edc:unimplval="0" edc:unused="0x0" edc:useinchecksum="0xffff">
        <edc:AliasList/>
        <edc:DCRModeList>
          <edc:DCRMode edc:id="DS.0">
            <edc:DCRFieldDef edc:cname="GWRP" edc:desc="General Segment Write-Protect bit" edc:mask="0x1" edc:name="GWRP" edc:nzwidth="1">
              <edc:DCRFieldSemantic edc:cname="OFF" edc:codeguardidref="PgmGenWrtProtectOff" edc:desc="General Segment may be written" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="ON" edc:codeguardidref="PgmGenWrtProtectOn" edc:desc="General Segment is write protected" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="GCP" edc:desc="General Segment Code-Protect bit" edc:mask="0x1" edc:name="GCP" edc:nzwidth="1">
              <edc:DCRFieldSemantic edc:cname="OFF" edc:codeguardidref="PgmGenNone" edc:desc="General Segment Code protect is Disabled" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="ON" edc:codeguardidref="PgmGenStd" edc:desc="General Segment Code protection Enabled" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:AdjustPoint edc:offset="2"/>
            <edc:AdjustPoint edc:offset="2"/>
          </edc:DCRMode>
        </edc:DCRModeList>
      </edc:DCRDef>
      <edc:DCRDef edc:access="----------------" edc:cname="Reserved" edc:default="0xffff" edc:desc="" edc:impl="0x0" edc:ishidden="true" edc:name="Reserved" edc:nzwidth="16" edc:unimplval="0" edc:unused="0x0" edc:useinchecksum="0xffff">
        <edc:AliasList/>
        <edc:DCRModeList>
          <edc:DCRMode edc:id="DS.0"/>
        </edc:DCRModeList>
      </edc:DCRDef>
      <edc:DCRDef edc:access="----------------" edc:cname="Reserved" edc:default="0xffff" edc:desc="" edc:impl="0x0" edc:ishidden="true" edc:name="Reserved" edc:nzwidth="16" edc:unimplval="0" edc:unused="0x0" edc:useinchecksum="0xffff">
        <edc:AliasList/>
        <edc:DCRModeList>
          <edc:DCRMode edc:id="DS.0"/>
        </edc:DCRModeList>
      </edc:DCRDef>
